{
   "scene100": {
	"event1":"These do-no-good'ers are super stuck in the mud when you get your hands on them.\nYou guess their previous pranks were not enough to satiate their crude humor.\nNow they have REALLY done it with their latest prank not on just one person, but the WHOLE TOWN!!\nWell, you don't know for sure if missing people are connected to these jokers, but these low-lifes are highly suspect.",
	"event2":"Fuming, you turn around to make your way to the forest.\nBut you see a hooded figure with villager's clothing a few meters away, rushing toward you with a stick brandished.",
	"event3":"This person is now unconscious.\nExamining him further reveals that he is your neighbor, Hurley.\nHe was always kind to you, but now he's defected?\nWhat happened while you were gone? More importantly, what will you do now?\n1) Restrain him and extract information\n2) Kill him and continue onto the forest",
	"choice1g":"You tie Hurley to the quest board with some nearby rope and extract information from him.\nHe reveals that something has captured and 'enlightened' all the townsfolk.\nHe passes out shortly after, having been overwhelmed.",
	"choice1e":"You finish off Hurley.\nWhatever caused Hurley to become like this, you know that the town (once everyone is found) would be better off without him.\nSearching his pockets for anything useful...\nHe had a note! It mentions something about all the townsfolk being captured and 'enlightened', whatever that means.",
	"event4":"In any case, you proceed to the forest.\nAfter an hour or two of searching around, you find out that your lead has gone cold.\nLiterally! The idiots of Townsburg are frozen in a giant block of purple perma-ice.\nNo way to melt that unless the original caster is killed.\nYou can't really do anything about that except two things:\n1) Leave it alone\n2) Push it into the deep river nearby",
	"choice2g":"Despite your past experiences with these jokers, depsite how much you hate them,\nyou resist the urge to push the ice block into the river.",
	"choice2e":"You let your past experiences with these jokers get the best of your judgement.\nWith the power that comes from your bottled-up anger, you push the ice block into the river,\nwatching it sink to the abyss with a faint smirk.",
	"event5":"With no leads, you wander deeper into the forest, hoping to run into something...\nAnd you do! Well, something ran into you and knocked you unconsious.\n\n\n\n\nYou wake up inside a large cave, bound by rope to a skull totem.\nIt's lit up with candles everywhere and purple rose symbols painted on its walls.\nYou also see someone walking towards you.\nIn the dim light of the candles, you recognize this person to be Curly!\n",
	"event6":"You always did have a super super uncrushable attraction to Curly, but you never had the stones to say how you feel.\nBut now she is in front of you, the both of you alone together. She couldn't even speak a syllable without you passionately admitting your feelings for her.\nThis was supposed to be the time where the antagonist reveals the master plan, but because of you, that part is pretty much skipped.\nAnnoyed, Curly undoes the ropes and takes an ominous t-pose stance.\nShe could have just killed you while you were tied.\nWas she flattered enough to give you a fighting chance?\nFor whatever the reason, its combat time, regardless if your heart dislikes the thought of hurting Curly.",
	"event7":"Curly is almost down for the count!\nBefore fainting, the evil essence that surrounded Curly dissapears.\n She weakly embraces you and whispers something.\nIn that same moment, an earthquake happens!\nThe cave is starting to drop rocks from the ceiling - the cave is going to collapse!\nYou instinctively rush to a tunnel opening, but you remember Curly.\nDecide how you will proceed:\n1)Leave\n2)Take her with you.",
	"choice3g":"Despite Curly's attempts to killing you, you still really really really really like her alot alot alot.\nGrabbing the ropes you were restrained with, you swiftly tie Curly to your back and haul cheeks out of there.\n\n\nYou and Curly make it out, thanks to your experience in escaping collapsing caverns!\nYou decide to return to town and have Curly rest there while you continue on with the quest (town is not too far from where you are now).",
	"choice3e":"You stand there, irrationally confused. Curly tried to kill you, and she almost succeeded!\nWhy in the world would she ever do that?\nMoreover, why would you ever want to court someone that never admitted her feelings for you, if any existed in the first place?!\n.........\nYou come to your senses - you wasted too much time.\nIts time to leave.\n\n\nYou make it out, thanks to your experience in escaping collapsing caverns!",
	"event8":"You recognize this area of the forest! Its the old mineshaft.\nYou remember back to your early years, when you and other kids played imaginary crusaders here.\nYou would climb the tree nearest to the mine entrance and scout ahead for the other crusaders.\nFrom what you remember when you scouted, you could see nothing but forest and another cave entrance in the nearby mountain side.\nCurious as to what has changed over the years, you climb that same tree.\nNothing looks new, except that there is a giant boulder with a painted smiley face blocking the entrance to the other cave.\nSomething seems to be happening inside that cave, as there is a bright purple light that periodically shines around the boulder.\nPurple means evil, so that is where you should probably go next.",
	"event9":"You make your way to the giant boulder.... and there it stands, doing what boulders do - nothing.\nYou don't see any way around it, and you can't seem to find anything you can use to move the rock\nYou guess the only way through is to destroy it.... HOWEVER!\nThe smiley face brings you great discomfort if you try to strike it down.\nDecide how you will proceed:\n1)Wash off the paint and destroy the boulder.\n2)Suck it up and destroy the darn boulder already!",
	"choice4g":"You just cant kill something that is so innocent as a happy boulder.\nYou try to wash off the painted face.\nIt is rather hot and humid currently, so you use your sweat as a paint thinner....\nSUCCESS! The smiley face is now gone, allowing you to destroy the boulder without great discomfort!",
	"choice4e":"You repeat to yourself that boulders are inanimate objects and that they dont have feelings.\nYou keep repeating to yourself, closing your eyes as you take a battle stance.\nYou figure in order to avoid feeling guilty, you must keep repeating it in your head without looking at the smiley face.",
	"event10":"In honor of such a fight, you decide to name the fallen boulder, Burly.\nProceeding further into the increasingly purple cave, the cave echoes voices of increasing intensity.\nYou reach the end of this cave tunnel. It's a large door, and the voices are coming from behind it.\nWith great force, you kick down the door!\nYou can't believe your eyes! You see before you all the missing townsfolk chanting some evil verse and prostrating themselves in front of a purple dragon!\nThe dragon takes notice to your intrusion, and stands on its four legs.\nThe townsfolk, purple-eyed, all stand up and line the cavern walls.\nIt seems like a final fight is at hand, and the winner of it decides the fate of the townsfolk and all those involved.",
	"endingg":"With the dragon slain, all the purple in the townfolks' eyes dissapear!\nIt seems like the death of that dragon broke everyone out of its evil influence!\nFor a few moments everyone was confused, wondering how they got here.\nAfter that, they all catch sight of you in front of a dead dragon.\nIn seconds you are cheered on and flooded with eternal gratitude.\nThey all swarm you and lift you up high.\nWith the evil gone from this place for good, everyone parades their way back to Townsburg.\n\n\nOn the way back, you reflect upon the events of this quest.\n Its a good thing you did not kill all those who opposed you (exept that dragon).\nOtherwise, you probably would not be able to continue living with such a guilty conscience.\nGood thing that never happened!\nAt town: you see Hurley and Curly, both having a chat with bandages wrapped around their heads and casts on various body parts.\nYou also see the town idiots in soaked clothing, shivering cold.\nAwesome! Everyone is here.... except one!\nIn honor of Burly's existence you paint a smiley face on the back of the quest board\n\n\nCongradulations, adventurer! You got the good ending! ",
	"endinge":"With the dragon slain, all the purple in the townfolks' eyes dissapear!\nIt seems like the death of that dragon broke everyone from its evil influence!\nA revelation hits you at that moment.\nMaybe you should not have killed those who opposed you.\nYou definitely saved the town, but you killed those who mattered more to you!\nHow could you have known before hand!\nYou did not know that if you resisted your lust for punishing the wrong-do'ers then EVERYONE would be fine.\nYou did not know, you did not know, you did not know...\nBefore the townsfolk could thank you, you run out the cave and into the forest, never to be seen by the townsfolk for a very long time!\n\n\nCongradulations, adventurer! You got the evil ending! ",
	"endingn":"With the dragon slain, all the purple in the townsfolk's eyes disappear!\nIt seems like the death of that dragon broke everyone from its evil influence!\nA revelation hits you at that moment.\nThe people you killed were indeed innocent.\nYou killed those who mattered to you, but you also kept a few of them alive and saved the townfolk!\nThere is guilt inside in you, but that does not make you undeserving of being called a hero.\nIn moments, you are picked up by a cheering crowd of townsfolk.\nYou all then parade back to Townsburg to celebrate your success.\nBut is it really a success if it meant that some had to die?\n\n\nCongradulations, adventurer! You got the neutral ending!"
   }

}
