{
   "scene000": {
	"event1":"After many many weeks of unsuccessful adventure-finding you have returned to your home town, Townburg.\nFrom what you could remember before you left, Townsburg used to be flourished with hundreds of townsfolk going about their happy lives.\nNow its a ghost-town.\nSomething mysterious is going on, and you do not like it right now at all!\nYou make your way towards the farcrier's news board - you call it a 'quest board.'\nIf any news or events were to ever happen in town, it would be posted here first.",
	"event2":"The quest board is overpopulated with weathered paper.\nFrom what you see, most of it are just 'Help Wanted' contracts written by alot of the townsfolk. \nAll of these are uninteresting.\nHowever, three papers grab your attention.\nYou are pretty sure that these were not here when you left.\nOne is a propaganda poster, the second is an advertisement, and third is .... interesting.",
	"event3":"The propaganda poster sports a purple and gold color scheme.\nIt seems to be sponsered by an unknown organization, represented by purple, thorned rose symbol.\nIt is calling for recruits to join their cause.\nA 'join our organization and your life will get better' kind of deal, you think.\nBefore leaving town you did hear talk about a small group of do-no-good'ers doing stupid things in the forest.\nSo could this group be them? Doing more no-good?",
	"event4":"The advertisement is painted with many shades of blues. Odd, green shapes are scattered about the deeper blue shades, some named and some unnamed.\nThe poster message reads, in a bulleted list,\n\n 'Tired of your current life? Ditch it today! Just go to Sir Dan's Wharf and follow these steps --> \nStep 1: join our crew\nStep 2: explore the Great Waters\nStep 3: ???\nStep 4: benefit for the rest of your life!'\nThe words for the third step are scatched out beyond recognition.",
	"event5":"What makes this last poster interesting is not its color scheme, but, rather, its message.\nIt seems to be written in some sort of peculiar lexicon.\n Latin, possibly? Whatever language this message is written in, you get a strange feeling the longer you stare at it. Not a creepy-strange, but a familiar-strange feeling.",
	"event6":"Decide on which poster to investigate further:\n1) Propaganda poster (forest quest)\n2) Advertisement (ocean quest)\n3) The strange poster (deep space quest)\n\nOcean and Space is a work in progress, but dont let that stop you from selecting it anyways :D\n(you can see the current state of each quest in the story folder)" 

  }
}

